p 'scan----------------------------------------------'
p '123 456 789'.scan(/\d+/)
p '1977年7月17日 2016年12月31日'.scan(/(\d+)年(\d+)月(\d+)日/)
p '1977年7月17日 2016年12月31日'.scan(/(?:\d+)年(?:\d+)月(?:\d+)日/)
p '1977年7月17日 2016年12月31日'.scan(/\d+年\d+月\d+日/)

p '[]-------------------------------------------------'
text = '郵便番号は123-4567です。'
p text[/\d{3}-\d{4}/]

text = '123-4567 456-7890'
p text[/\d{3}-\d{4}/]

text = '誕生日は1977年7月17日です'
p text[/(\d+)年(\d+)月(\d+)日/]
p text[/(\d+)年(\d+)月(\d+)日/, 3]

text = '誕生日は1977年7月17日です。'
p text[/(?<year>\d+)年(?<month>\d+)月(?<day>\d+)日/, :day]
p text[/(?<year>\d+)年(?<month>\d+)月(?<day>\d+)日/, 'day']

p 'slice,slice!-------------------------------------------------'
text = '郵便番号は123-4567'
p text.slice(/\d{3}-\d{4}/)
text = '誕生日は1977年7月17日です'
p text.slice(/(\d+)年(\d+)月(\d+)日/, 3)

text = '郵便番号は123-4567です'
p text.slice!(/\d{3}-\d{4}/)
p text

p 'split-------------------------------------------------------------'
text = '123, 456-789'
p text.split(',')
p text.split(/,|-/)

p 'gsub,gsub!----------------------------------------------------'
text = '123,456-789'
p text.gsub(',', ':')
p text.gsub(/,|-/, ':')

text = '誕生日は1977年7月17日です'
p text.gsub(/(\d+)年(\d+)月(\d+)日/, '\1-\2-\3')

text = '誕生日は1977年7月17日です'
p text.gsub(
  /(?<year>\d+)年(?<month>\d+)月(?<day>\d+)日/,
  '\k<year>-\k<month>-\k<day>'
)

text = '123,456-789'
hash = { ',' => ':', '-' => '/' }
p text.gsub(/,|-/, hash)

text = '123,456-789'
p text.gsub(/,|-/) { |matched| matched == ',' ? ':' : '/' }

text = '123,456-789'
p text.gsub!(/,|-/, ':')
p text
